; domain
(define (domain grid_domain)
	(:requirements :strips)
	(:predicates (pos ?x) (adj ?x1 ?x2) )

		(:action move
			:parameters (?x1 ?x2)
			:precondition (and (pos ?x1) (adj ?x1 ?x2))
			:effect (and (pos ?x2) (not (pos ?x1)))
		)

)

; problem
(define (problem nine)
	(:domain grid_domain)
	(:objects  P1 P2 P3 P4 P5 P6 P7 P8 P9)
	(:init
		(adj P1 P2)
		(adj P1 P4)
		(adj P2 P3)
		(adj P2 P1)
		(adj P2 P5)
		(adj P3 P2)
		(adj P3 P6)
		(adj P4 P5)
		(adj P4 P1)
		(adj P4 P7)
		(adj P5 P6)
		(adj P5 P4)
		(adj P5 P2)
		(adj P5 P8)
		(adj P6 P5)
		(adj P6 P3)
		(adj P6 P9)
		(adj P7 P8)
		(adj P7 P4)
		(adj P8 P9)
		(adj P8 P7)
		(adj P8 P5)
		(adj P9 P8)
		(adj P9 P6)
		(pos P1)
	)
	(:goal
		(and
			(pos P9)
		)
	)
)

; plan
1. (move p1 p2)
   deleted: (pos p1)
   added: (pos p2)
   goals met: 0 of 1
2. (move p2 p3)
   deleted: (pos p2)
   added: (pos p3)
   goals met: 0 of 1
3. (move p3 p6)
   deleted: (pos p3)
   added: (pos p6)
   goals met: 0 of 1
4. (move p6 p9)
   deleted: (pos p6)
   added: (pos p9)
   goals met: 1 of 1
